cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'caskroom/fonts'

tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/versions'

###############################################################################
# Brews
###############################################################################

brew 'cheat'
brew 'chisel'
brew 'cloc'
brew 'curl', args: ['with-nghttp2']
brew 'diff-so-fancy'
brew 'git'
brew 'grc'
brew 'httpie'
brew 'hub'
brew 'imagemagick'
brew 'ios-sim'
brew 'jp2a'
brew 'jrnl'
brew 'mas'
brew 'percol'
brew 'python3'
brew 'rbenv'
brew 'rename'
brew 'homebrew/dupes/rsync'
brew 'shellcheck'
brew 'sleepwatcher'
brew 'ssh-copy-id'
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew 'thefuck'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'vim', args: ['with-override-system-vi']
brew 'wget'
brew 'youtube-dl'
brew 'z'
brew 'zsh'
brew 'zsh-completions'

###############################################################################
# Apps from Caskroom
###############################################################################

cask '1password'
cask 'appcleaner'
cask 'atext'
cask 'atom'
cask 'base'
cask 'calibre'
cask 'cerebro'
cask 'coconutbattery'
cask 'dash'
cask 'dictunifier'
cask 'dropbox'
cask 'evernote'
cask 'flux'
cask 'rowanj-gitx'
cask 'google-chrome'
cask 'hazel3'
cask 'imageoptim'
cask 'iterm2'
cask 'keepingyouawake'
cask 'kindle'
cask 'macvim'
cask 'mou'
cask 'numi'
cask 'nvalt'
cask 'postman'
cask 'realm-browser'
cask 'selfcontrol'
cask 'sequel-pro'
cask 'sigil'
cask 'skala-preview'
cask 'skitch'
cask 'skype'
cask 'slack'
cask 'smaller'
cask 'spark-inspector'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
cask 'vlc'
cask 'wireshark'
cask 'whatsapp'

# QuickLook plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'

# Screensaver
cask 'fliqlo'

###############################################################################
# Apps from Mac App Store
###############################################################################

mas 'Slicy', id: 512533449
mas 'Better Rename 9', id: 414209656
mas 'Zonebox', id: 597870795 # productivity tool
mas 'Patterns', id: 429449079
mas 'TextNut', id: 933104554
mas 'Textual 5', id: 896450579 # irc client
mas 'HTTPLook', id: 1166107379 # proxy, all http traffic frome phone
mas 'Soulver', id: 413965349
mas 'ReadKit', id: 588726889
mas 'Go2Shell', id: 445770608
mas 'Instant Convert', id: 846717884 # converts from one image format to another
mas 'Screeny', id: 440991524
mas 'UnixTimeStamp', id: 497928786
mas 'CheatSheet', id: 529456740
mas 'PrivacyScan', id: 494950833
mas 'iRamDisk', id: 492615400
mas 'Money Pro', id: 972572731
mas 'Numi 2', id: 692815145
mas 'SimpleRecorderPlus', id: 1084332555
mas 'Rested', id: 421879749
mas 'Sip', id: 507257563
mas 'StoreView', id: 961027437 # displays how app will look in app store
mas 'PhotoBulk', id: 537211143
mas 'Pixel Perfect', id: 916097243
mas 'iA Writer Classic', id: 439623248
mas 'Wallcat', id: 1000397973
mas 'Sooey', id: 1114368743 # translates ios/mac strings files
mas 'CodeBox', id: 412536790
mas 'TogglDesktop', id: 957734279
mas 'Screentaker', id: 460043075
mas 'Sparrow', id: 417250177
mas 'LilyView', id: 529490330
mas 'GIF Brewery 3', id: 1081413713
mas 'Gemini', id: 463541543
mas 'SQLPro for SQLite', id: 586001240
mas 'Pages', id: 409201541
mas 'Radium', id: 597611879
mas 'Numbers', id: 409203825
mas 'iTranslate', id: 884952790
mas 'Keynote', id: 409183694
mas 'CodeRunner', id: 433335799
mas 'MWeb Lite', id: 979033429
mas 'Degrees', id: 430173763
mas 'Coinverter', id: 926121450
mas 'ForkLift', id: 412448059
mas 'Tweetbot', id: 557168941
