tap 'homebrew/bundle'
tap 'homebrew/core'

###############################################################################
# Brews
###############################################################################

brew 'carthage'
brew 'cheat'
brew 'chisel', args: ["HEAD"] # releases are not made regularly
brew 'cloc'
brew 'coreutils'
brew 'cowsay'
brew 'curl'
brew 'diff-so-fancy'
brew 'ffmpeg'
brew 'fzf'
brew 'git'
brew 'grc'
brew 'highlight'
brew 'httpie'
brew 'hub'
brew 'imagemagick'
brew 'ios-sim'
brew 'jid'
brew 'jo'
brew 'jp2a'
brew 'jq'
brew 'jrnl'
brew 'jsonlint'
brew 'mitmproxy'
brew 'ncdu' # ncurses disk usage app
brew 'peco'
brew 'percol'
brew 'pv'
brew 'python3'
brew 'rbenv'
brew 'rename'
brew 'rsync'
brew 'slugify'
brew 'speedtest_cli'
brew 'ssh-copy-id'
brew 'the_silver_searcher'
brew 'thefuck'
brew 'tldr'
brew 'tmux'
brew 'tree'
# brew 'vim', args: ['with-override-system-vi']
brew 'wakeonlan'
brew 'wifi-password'
brew 'wget'
brew 'youtube-dl'
brew 'z'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
