cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/core'
tap 'buo/cask-upgrade'

###############################################################################
# Apps from Caskroom
###############################################################################

cask '1password'
cask 'adobe-acrobat-reader'
cask 'alfred'
cask 'android-studio'
cask 'apparency'
cask 'appcleaner'
cask 'asset-catalog-tinkerer'
cask 'atext'
cask 'audacity'
cask 'balenaetcher'
cask 'base'
cask 'basictex'
cask 'charles'
cask 'claude-code'
cask 'coconutbattery'
cask 'codex-app'
cask 'colorsnapper'
cask 'cursor'
cask 'cyberduck'
cask 'daisydisk'
cask 'dash'
cask 'discord'
cask 'dropbox'
cask 'figma'
cask 'firefox'
cask 'flux-app'
cask 'fork'
cask 'flutter'
cask 'fsnotes'
cask 'google-chrome'
cask 'imageoptim'
cask 'ipatool'
cask 'istat-menus'
cask 'iterm2'
cask 'jordanbaird-ice'
cask 'keepingyouawake'
cask 'latest'
cask 'logi-options+'
cask 'macwhisper'
cask 'mp3gain-express'
cask 'mp3tag'
cask 'mtmr'
cask 'nucleo'
cask 'numi'
cask 'obsidian'
cask 'pocket-casts'
cask 'postman'
cask 'rectangle'
cask 'selfcontrol'
cask 'sf-symbols'
cask 'sigil'
cask 'signal'
cask 'sip-app'
cask 'slack'
cask 'soulver-cli'
cask 'spotify'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'vlc'
cask 'webex'
cask 'whatsapp'
cask 'windsurf'
cask 'xcodes'
cask 'xcodes-app'
cask 'zoom'

# QuickLook plugins
cask 'suspicious-package'
cask 'qlvideo'

# Fonts
cask 'font-fira-code'
cask 'font-inconsolata-dz-for-powerline'
cask 'font-inconsolata-g'
cask 'font-jetbrains-mono'
cask 'font-meslo-lg'

# Drivers (printers etc.)
cask 'apple-hewlett-packard-printer-drivers'